Continued apply output from previous comment.
<details><summary>Show Output</summary>

```diff
role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-3]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-0]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-1]
module.sbeacon.module.lambda-getAnalyses.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getAnalyses:sbeacon-backend-getAnalyses-2]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[3]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-3]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-0]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[1]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-1]
module.sbeacon.module.lambda-getGenomicVariants.aws_iam_role_policy.additional_jsons[2]: Refreshing state... [id=sbeacon-backend-getGenomicVariants:sbeacon-backend-getGenomicVariants-2]
module.sbeacon.aws_lambda_permission.APIdportal_proxy: Refreshing state... [id=AllowAPIdportal_proxyInvoke]
module.sbeacon.aws_api_gateway_integration.dportal_proxy: Refreshing state... [id=agi-auudf51p4c-zjwczl-ANY]
module.sbeacon.module.lambda-getDatasets.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getDatasets]
module.svep[0].aws_api_gateway_deployment.VPApi: Refreshing state... [id=3trr1a]
module.sbeacon.module.lambda-getIndividuals.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getIndividuals]
module.sbeacon.module.lambda-getBiosamples.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getBiosamples]
module.sbeacon.module.lambda-getRuns.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getRuns]
module.sbeacon.module.lambda-getAnalyses.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getAnalyses]
module.sbeacon.aws_api_gateway_integration_response.dportal_proxy: Refreshing state... [id=agir-auudf51p4c-zjwczl-ANY-200]
module.svep[0].aws_api_gateway_stage.VPApi: Refreshing state... [id=ags-pihbmfom84-prod]
module.sbeacon.module.lambda-getGenomicVariants.aws_lambda_function.this[0]: Refreshing state... [id=sbeacon-backend-getGenomicVariants]
module.sbeacon.aws_lambda_permission.APIdatasetsIdbiosamples: Refreshing state... [id=AllowAPIdatasetsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsId: Refreshing state... [id=AllowAPIdatasetsIdInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdg_variants: Refreshing state... [id=AllowAPIdatasetsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples: Refreshing state... [id=agi-auudf51p4c-3vivi6-GET]
module.sbeacon.aws_lambda_permission.APIdatasets: Refreshing state... [id=AllowAPIdatasetsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsFilteringTerms: Refreshing state... [id=AllowAPIdatasetsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdindividuals: Refreshing state... [id=AllowAPIdatasetsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIdatasetsIdfiltering_terms: Refreshing state... [id=AllowAPIdatasetsIdfiltering_termsInvoke]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms: Refreshing state... [id=agi-auudf51p4c-jnmq3v-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id: Refreshing state... [id=agi-auudf51p4c-fyhv7o-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-ubnq59-POST]
module.sbeacon.aws_api_gateway_integration.datasets: Refreshing state... [id=agi-auudf51p4c-o1bur6-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id_post: Refreshing state... [id=agi-auudf51p4c-fyhv7o-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms: Refreshing state... [id=agi-auudf51p4c-tx4nza-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-y5t5hi-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-tx4nza-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-g_variants: Refreshing state... [id=agi-auudf51p4c-y5t5hi-GET]
module.sbeacon.aws_api_gateway_integration.datasets_post: Refreshing state... [id=agi-auudf51p4c-o1bur6-POST]
module.sbeacon.aws_api_gateway_integration.datasets-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-jnmq3v-POST]
module.sbeacon.aws_api_gateway_integration.datasets-id-individuals: Refreshing state... [id=agi-auudf51p4c-ubnq59-GET]
module.sbeacon.aws_api_gateway_integration.datasets-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-3vivi6-POST]
module.svep[0].aws_api_gateway_method_settings.VPApi: Refreshing state... [id=pihbmfom84-prod-*/*]
module.svep[0].aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E2VOWED91CBL3B]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants: Refreshing state... [id=agi-auudf51p4c-facarh-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-nb8c7s-POST]
module.sbeacon.aws_api_gateway_integration.individuals: Refreshing state... [id=agi-auudf51p4c-u79iwd-GET]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-3jtaho-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-biosamples: Refreshing state... [id=agi-auudf51p4c-nb8c7s-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id_post: Refreshing state... [id=agi-auudf51p4c-sjks3s-POST]
module.sbeacon.aws_api_gateway_integration.individuals-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-facarh-POST]
module.sbeacon.aws_api_gateway_integration.individuals-filtering_terms: Refreshing state... [id=agi-auudf51p4c-3jtaho-GET]
module.sbeacon.aws_api_gateway_integration.individuals-id: Refreshing state... [id=agi-auudf51p4c-sjks3s-GET]
module.sbeacon.aws_api_gateway_integration.individuals_post: Refreshing state... [id=agi-auudf51p4c-u79iwd-POST]
module.sbeacon.aws_lambda_permission.APIindividualsIdbiosamples: Refreshing state... [id=AllowAPIindividualsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIindividuals: Refreshing state... [id=AllowAPIindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsFilteringTerms: Refreshing state... [id=AllowAPIindividualsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsIdg_variants: Refreshing state... [id=AllowAPIindividualsIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIindividualsId: Refreshing state... [id=AllowAPIindividualsIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples: Refreshing state... [id=agir-auudf51p4c-3vivi6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id: Refreshing state... [id=agir-auudf51p4c-fyhv7o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms: Refreshing state... [id=agir-auudf51p4c-jnmq3v-GET-200]
module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses: Refreshing state... [id=agmr-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-ubnq59-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets: Refreshing state... [id=agir-auudf51p4c-o1bur6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id_post: Refreshing state... [id=agir-auudf51p4c-fyhv7o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-y5t5hi-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms: Refreshing state... [id=agir-auudf51p4c-tx4nza-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-g_variants: Refreshing state... [id=agir-auudf51p4c-y5t5hi-GET-200]
module.sbeacon.aws_api_gateway_integration_response.datasets_post: Refreshing state... [id=agir-auudf51p4c-o1bur6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-3vivi6-POST-200]
module.sbeacon.aws_lambda_permission.APIbiosamplesFilteringTerms: Refreshing state... [id=AllowAPIbiosamplesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamples: Refreshing state... [id=AllowAPIbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdg_variants: Refreshing state... [id=AllowAPIbiosamplesIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id: Refreshing state... [id=agi-auudf51p4c-q1jifp-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs_post: Refreshing state... [id=agi-auudf51p4c-j0sm1h-POST]
module.sbeacon.aws_api_gateway_integration.biosamples_post: Refreshing state... [id=agi-auudf51p4c-6bnaby-POST]
module.sbeacon.aws_api_gateway_integration.biosamples: Refreshing state... [id=agi-auudf51p4c-6bnaby-GET]
module.sbeacon.aws_lambda_permission.APIbiosamplesId: Refreshing state... [id=AllowAPIbiosamplesIdInvoke]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses: Refreshing state... [id=agi-auudf51p4c-1yp0in-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id_post: Refreshing state... [id=agi-auudf51p4c-q1jifp-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-pgsebc-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-runs: Refreshing state... [id=agi-auudf51p4c-j0sm1h-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms: Refreshing state... [id=agi-auudf51p4c-nftwai-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-1yp0in-POST]
module.sbeacon.aws_api_gateway_integration.biosamples-id-g_variants: Refreshing state... [id=agi-auudf51p4c-pgsebc-GET]
module.sbeacon.aws_api_gateway_integration.biosamples-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-nftwai-POST]
module.sbeacon.aws_api_gateway_integration_response.datasets-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-jnmq3v-POST-200]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdruns: Refreshing state... [id=AllowAPIbiosamplesIdrunsInvoke]
module.sbeacon.aws_lambda_permission.APIbiosamplesIdanalyses: Refreshing state... [id=AllowAPIbiosamplesIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-individuals: Refreshing state... [id=agir-auudf51p4c-ubnq59-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals: Refreshing state... [id=agir-auudf51p4c-u79iwd-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-nb8c7s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants: Refreshing state... [id=agir-auudf51p4c-facarh-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-3jtaho-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id_post: Refreshing state... [id=agir-auudf51p4c-sjks3s-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-facarh-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-filtering_terms: Refreshing state... [id=agir-auudf51p4c-3jtaho-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals_post: Refreshing state... [id=agir-auudf51p4c-u79iwd-POST-200]
module.sbeacon.aws_lambda_permission.APIanalysesIdg_variants: Refreshing state... [id=AllowAPIanalysesIdg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesFilteringTerms: Refreshing state... [id=AllowAPIanalysesFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIanalyses: Refreshing state... [id=AllowAPIanalysesInvoke]
module.sbeacon.aws_lambda_permission.APIanalysesId: Refreshing state... [id=AllowAPIanalysesIdInvoke]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-vxkjof-POST]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms: Refreshing state... [id=agi-auudf51p4c-a62i9b-GET]
module.sbeacon.aws_api_gateway_integration.analyses-id_post: Refreshing state... [id=agi-auudf51p4c-3o2mt5-POST]
module.sbeacon.aws_api_gateway_integration.analyses_post: Refreshing state... [id=agi-auudf51p4c-1q0gx4-POST]
module.sbeacon.aws_api_gateway_integration.analyses: Refreshing state... [id=agi-auudf51p4c-1q0gx4-GET]
module.sbeacon.aws_api_gateway_integration.analyses-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-a62i9b-POST]
module.sbeacon.aws_api_gateway_integration.analyses-id: Refreshing state... [id=agi-auudf51p4c-3o2mt5-GET]
module.sbeacon.aws_lambda_permission.APIruns: Refreshing state... [id=AllowAPIrunsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-id_post: Refreshing state... [id=agi-auudf51p4c-kga52w-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses: Refreshing state... [id=agi-auudf51p4c-ho1m5d-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-analyses_post: Refreshing state... [id=agi-auudf51p4c-ho1m5d-POST]
module.sbeacon.aws_api_gateway_integration.runs_post: Refreshing state... [id=agi-auudf51p4c-j5giw6-POST]
module.sbeacon.aws_lambda_permission.APIrunsIdanalyses: Refreshing state... [id=AllowAPIrunsIdanalysesInvoke]
module.sbeacon.aws_api_gateway_integration.g_variants-id: Refreshing state... [id=agi-auudf51p4c-3n9fhg-GET]
module.sbeacon.aws_api_gateway_integration.g_variants_post: Refreshing state... [id=agi-auudf51p4c-budf3y-POST]
module.sbeacon.aws_lambda_permission.APIrunsId: Refreshing state... [id=AllowAPIrunsIdInvoke]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms: Refreshing state... [id=agi-auudf51p4c-vqjww2-GET]
module.sbeacon.aws_lambda_permission.APIrunsFilteringTerms: Refreshing state... [id=AllowAPIrunsFilteringTermsInvoke]
module.sbeacon.aws_lambda_permission.APIrunsIdg_variants: Refreshing state... [id=AllowAPIrunsIdg_variantsInvoke]
module.sbeacon.aws_api_gateway_integration.runs-filtering_terms_post: Refreshing state... [id=agi-auudf51p4c-vqjww2-POST]
module.sbeacon.aws_api_gateway_integration.runs: Refreshing state... [id=agi-auudf51p4c-j5giw6-GET]
module.sbeacon.aws_api_gateway_integration.runs-id: Refreshing state... [id=agi-auudf51p4c-kga52w-GET]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants_post: Refreshing state... [id=agi-auudf51p4c-yoq0wr-POST]
module.sbeacon.aws_api_gateway_integration.runs-id-g_variants: Refreshing state... [id=agi-auudf51p4c-yoq0wr-GET]
module.sbeacon.aws_api_gateway_integration.g_variants: Refreshing state... [id=agi-auudf51p4c-budf3y-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals_post: Refreshing state... [id=agi-auudf51p4c-19r55o-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-individuals: Refreshing state... [id=agi-auudf51p4c-19r55o-GET]
module.sbeacon.aws_api_gateway_integration.g_variants-id_post: Refreshing state... [id=agi-auudf51p4c-3n9fhg-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples_post: Refreshing state... [id=agi-auudf51p4c-zajmnx-POST]
module.sbeacon.aws_api_gateway_integration.g_variants-id-biosamples: Refreshing state... [id=agi-auudf51p4c-zajmnx-GET]
module.sbeacon.aws_lambda_permission.APIg_variantsIdbiosamples: Refreshing state... [id=AllowAPIg_variantsIdbiosamplesInvoke]
module.sbeacon.aws_lambda_permission.APIg_variants: Refreshing state... [id=AllowAPIg_variantsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsIdindividuals: Refreshing state... [id=AllowAPIg_variantsIdindividualsInvoke]
module.sbeacon.aws_lambda_permission.APIg_variantsId: Refreshing state... [id=AllowAPIg_variantsIdInvoke]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id: Refreshing state... [id=agir-auudf51p4c-q1jifp-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples_post: Refreshing state... [id=agir-auudf51p4c-6bnaby-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples: Refreshing state... [id=agir-auudf51p4c-6bnaby-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses: Refreshing state... [id=agir-auudf51p4c-1yp0in-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id_post: Refreshing state... [id=agir-auudf51p4c-q1jifp-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-pgsebc-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs: Refreshing state... [id=agir-auudf51p4c-j0sm1h-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms: Refreshing state... [id=agir-auudf51p4c-nftwai-GET-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-1yp0in-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-nftwai-POST-200]
module.sbeacon.aws_api_gateway_integration_response.datasets-id-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-tx4nza-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-runs_post: Refreshing state... [id=agir-auudf51p4c-j0sm1h-POST-200]
module.sbeacon.aws_api_gateway_integration_response.biosamples-id-g_variants: Refreshing state... [id=agir-auudf51p4c-pgsebc-GET-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id-biosamples: Refreshing state... [id=agir-auudf51p4c-nb8c7s-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id_post: Refreshing state... [id=agir-auudf51p4c-3o2mt5-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses_post: Refreshing state... [id=agir-auudf51p4c-1q0gx4-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses: Refreshing state... [id=agir-auudf51p4c-1q0gx4-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-a62i9b-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id: Refreshing state... [id=agir-auudf51p4c-3o2mt5-GET-200]
module.sbeacon.aws_api_gateway_integration.analyses-id-g_variants: Refreshing state... [id=agi-auudf51p4c-vxkjof-GET]
module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants: Refreshing state... [id=agmr-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses: Refreshing state... [id=agir-auudf51p4c-ho1m5d-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post: Refreshing state... [id=agir-auudf51p4c-ho1m5d-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs_post: Refreshing state... [id=agir-auudf51p4c-j5giw6-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id: Refreshing state... [id=agir-auudf51p4c-3n9fhg-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-filtering_terms: Refreshing state... [id=agir-auudf51p4c-a62i9b-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post: Refreshing state... [id=agir-auudf51p4c-vqjww2-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs: Refreshing state... [id=agir-auudf51p4c-j5giw6-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id: Refreshing state... [id=agir-auudf51p4c-kga52w-GET-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-yoq0wr-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants: Refreshing state... [id=agir-auudf51p4c-yoq0wr-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants: Refreshing state... [id=agir-auudf51p4c-budf3y-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals_post: Refreshing state... [id=agir-auudf51p4c-19r55o-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-individuals: Refreshing state... [id=agir-auudf51p4c-19r55o-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id_post: Refreshing state... [id=agir-auudf51p4c-3n9fhg-POST-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants_post: Refreshing state... [id=agir-auudf51p4c-vxkjof-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-id_post: Refreshing state... [id=agir-auudf51p4c-kga52w-POST-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants_post: Refreshing state... [id=agir-auudf51p4c-budf3y-POST-200]
module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms: Refreshing state... [id=agir-auudf51p4c-vqjww2-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples: Refreshing state... [id=agir-auudf51p4c-zajmnx-GET-200]
module.sbeacon.aws_api_gateway_integration_response.analyses-id-g_variants: Refreshing state... [id=agir-auudf51p4c-vxkjof-GET-200]
module.sbeacon.aws_api_gateway_integration_response.g_variants-id-biosamples_post: Refreshing state... [id=agir-auudf51p4c-zajmnx-POST-200]
module.sbeacon.aws_api_gateway_integration_response.individuals-id: Refreshing state... [id=agir-auudf51p4c-sjks3s-GET-200]
module.sbeacon.module.cors-datasets-id-biosamples.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-3vivi6-OPTIONS-200]
module.sbeacon.aws_api_gateway_deployment.BeaconApi: Refreshing state... [id=axo133]
module.sbeacon.aws_api_gateway_stage.BeaconApi: Refreshing state... [id=ags-auudf51p4c-prod]
module.sbeacon.aws_api_gateway_method_settings.BeaconApi: Refreshing state... [id=auudf51p4c-prod-*/*]
module.sbeacon.aws_cloudfront_distribution.api_distribution: Refreshing state... [id=E1ACA5WT51ELER]
module.webgui.data.external.build: Reading...
module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy: Refreshing state... [id=b8634475-d812-42ad-9dde-cd31725a80cb]
module.webgui.aws_cloudfront_distribution.bui-s3-distribution: Refreshing state... [id=E8Z5K385KM143]
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Reading...
module.webgui.data.aws_iam_policy_document.s3_access_from_cloudfront: Read complete after 0s [id=4144518607]
module.webgui.terraform_data.cloudfront-version-invalidate: Refreshing state... [id=0e25688f-2f18-1874-e3c4-00c0b2d877d2]
module.webgui.aws_ssm_parameter.bui-ssm-beacon-ui-url: Refreshing state... [id=bui-ssm-beacon-ui-url]
module.webgui.aws_s3_bucket_policy.s3_access_from_cloudfront: Refreshing state... [id=webgui-bucket-20250513021738584800000001]
module.sbeacon.module.cors-info-root.aws_api_gateway_integration_response._: Refreshing state... [id=agir-auudf51p4c-fljl4i4t93-OPTIONS-200]
module.webgui.data.external.build: Still reading... [10s elapsed]
module.webgui.data.external.build: Still reading... [20s elapsed]
module.webgui.data.external.build: Still reading... [30s elapsed]
module.webgui.data.external.build: Still reading... [40s elapsed]
module.webgui.data.external.build: Still reading... [50s elapsed]
module.webgui.data.external.build: Still reading... [1m0s elapsed]
module.webgui.data.external.build: Still reading... [1m10s elapsed]
module.webgui.data.external.build: Read complete after 1m19s [id=-]
module.webgui.null_resource.s3-upload: Refreshing state... [id=3250323470975810753]
module.webgui.null_resource.cloudfront-invalidate: Refreshing state... [id=4246051607223719491]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:93ca818b17905fe2d08787926783434784d2f98396b39c1ba84b6cb3b205c81b460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      - image_id     = "sha256:93ca818b17905fe2d08787926783434784d2f98396b39c1ba84b6cb3b205c81b" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this has been deleted
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:c299a63cd84b5175e22b6a45395d0e8e7a51257e055fca0115d981df1cbdc46e" -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers" -> null
        # (4 unchanged attributes hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_image.this has been deleted
  - resource "docker_image" "this" {
        id           = "sha256:f485ae129bd2d3feb8c378ae65a49f4882e5aade43ae251361aca59659c7c3d2460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers"
      - image_id     = "sha256:f485ae129bd2d3feb8c378ae65a49f4882e5aade43ae251361aca59659c7c3d2" -> null
      - name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.svep[0].module.docker_image_qcFigures_lambda.docker_registry_image.this has been deleted
  - resource "docker_registry_image" "this" {
      - id                   = "sha256:f664354ef9b82ad70f4d5a6d7b8ede81507f68d25a2a7b2bd2d4048d9872bafb" -> null
      - name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/svep-qcfigures-lambda-containers" -> null
        # (4 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.gaspifs.null_resource.gaspifs-upload will be created
  + resource "null_resource" "gaspifs-upload" {
      + id       = (known after apply)
      + triggers = {
          + "cargo_lock_hash"  = "df3d79f6946394d188a60268e5519c322e98d5ab"
          + "cargo_toml_hash"  = "07ebe065b46a160fc6ba48f308d26508e3cd9d6a"
          + "docker_file_hash" = "a20d1ec7ca803881a0e501bb2d176e636409a8c3"
          + "source_hash"      = "cf4a361237609d6aaadccf79ead79e97d4bf5608"
        }
    }

  # module.sbeacon.data.aws_iam_policy_document.data-portal-lambda-access will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "data-portal-lambda-access" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchGetItem",
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinical-annotations",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinical-variants",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-juptyer-notebooks",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-pricing-cache",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-projects",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-saved-queries",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-info",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-users-quota",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "pricing:*",
            ]
          + effect    = "Allow"
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:Query",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
              + "arn:aws:dynamodb:ap-southeast-3:460722568061:table/sbeacon-dataportal-project-users/index/uid-index",
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:460722568061:userpool/ap-southeast-3_TxZFmgKtd",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:AddTags",
              + "sagemaker:CreateNotebookInstance",
              + "sagemaker:CreatePresignedNotebookInstanceUrl",
              + "sagemaker:DeleteNotebookInstance",
              + "sagemaker:DescribeNotebookInstance",
              + "sagemaker:ListNotebookInstances",
              + "sagemaker:StartNotebookInstance",
              + "sagemaker:StopNotebookInstance",
              + "sagemaker:UpdateNotebookInstance",
            ]
          + resources = [
              + "arn:aws:sagemaker:ap-southeast-3:460722568061:notebook-instance/*",
            ]
        }
      + statement {
          + actions   = [
              + "sagemaker:ListNotebookInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::460722568061:role/sbeacon_backend_sagemaker_jupyter_instance_role",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002",
            ]

          + condition {
              + test     = "StringLike"
              + values   = [
                  + "projects/*",
                  + "private/*",
                ]
              + variable = "s3:prefix"
            }
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/*",
              + "arn:aws:s3:::gasi-metadata-20250513021731641000000004/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/private/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-regions-20250815040233979200000002/*",
              + "arn:aws:s3:::svep-backend-temp-20250815040233979100000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-generateCohortVCfs",
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-generateReports",
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-indexer",
              + "arn:aws:lambda:ap-southeast-3:460722568061:function:sbeacon-backend-submitDataset",
            ]
        }
    }

  # module.sbeacon.aws_dynamodb_table.dataportal_cli_upload will be created
  + resource "aws_dynamodb_table" "dataportal_cli_upload" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "uid"
      + id               = (known after apply)
      + name             = "sbeacon-dataportal-cli-upload"
      + range_key        = "upload_id"
      + read_capacity    = (known after apply)
      + region           = "ap-southeast-3"
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "project_name"
          + type = "S"
        }
      + attribute {
          + name = "uid"
          + type = "S"
        }
      + attribute {
          + name = "upload_id"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "project_name"
          + name               = "cli-uploads-project-name-index"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "uid"
          + read_capacity      = (known after apply)
          + write_capacity     = (known after apply)

          + warm_throughput (known after apply)
        }

      + point_in_time_recovery (known after apply)

      + server_side_encryption (known after apply)

      + ttl {
          + attribute_name = "ExpirationTime"
          + enabled        = true
        }

      + warm_throughput (known after apply)
    }

  # module.sbeacon.aws_iam_policy.sagemaker_jupyter_instance_policy will be created
  + resource "aws_iam_policy" "sagemaker_jupyter_instance_policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Sagemaker Jupyter instance to access GASPI-ETL notebooks and gaspifs binary"
      + id               = (known after apply)
      + name             = "sagemaker_jupyter_instance_policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::gasi-dataportal-20250513021720562800000002/binaries/gaspifs*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment" = "uat"
          + "NAME"        = "sbeacon-backend"
          + "Owner"       = "gaspi"
        }
    }

  # module.sbeacon.aws_iam_role_policy_attachment.sagemaker_jupyter_instance_role_attachment will be created
  + resource "aws_iam_role_policy_attachment" "sagemaker_jupyter_instance_role_attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "sbeacon_backend_sagemaker_jupyter_instance_role"
    }

  # module.sbeacon.aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:13" -> (known after apply)
      ~ code_sha256                 = "Ftr6vSDiglW5dJK3BvOVvuIUk2pNP9sxRPwPDnFHFWs=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T08:54:23.285+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer:13" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "vAr5SqDBtuVprPwGZmgCSOKBIfFbIkGyAglGNJ7SFwC/So5cJhT3jbgq24nWAVh3cQ8zM2wMjTdRl4m3UOcd2w==" -> "qt5FM9tuTLcfgfT5KP2QgzDgdeymB2MxDwwg1vaRMFt+dVZ4Jvb1z9rTqots7q2GRleiWkHNMX7ro0HlF+alOA==" # forces replacement
      ~ source_code_size            = 18449706 -> (known after apply)
      ~ version                     = "13" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sbeacon.aws_s3_bucket_notification.updateFiles will be updated in-place
  ~ resource "aws_s3_bucket_notification" "updateFiles" {
      ~ eventbridge = true -> false
        id          = "gasi-dataportal-20250513021720562800000002"
        # (2 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.sbeacon.aws_sagemaker_notebook_instance_lifecycle_configuration.sagemaker_jupyter_instance_lcc will be updated in-place
  ~ resource "aws_sagemaker_notebook_instance_lifecycle_configuration" "sagemaker_jupyter_instance_lcc" {
        id        = "clone-gaspi-notebooks"
        name      = "clone-gaspi-notebooks"
      ~ on_create = "IyEvYmluL2Jhc2gKCiMgUmVtb3ZlIGV4aXN0aW5nIHN5bWJvbGljIGxpbmsgYW5kIGNsb25lIGZyZXNoIG5vdGVib29rcyByZXBvc2l0b3J5CnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKIyBSZW1vdmUgU1NIIGNsaWVudHMgYW5kIHNlcnZlciBwYWNrYWdlcyBmb3Igc2VjdXJpdHkKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiU3RhcnRpbmcgbGlmZWN5Y2xlIG9uX2NyZWF0ZSBjb25maWd1cmF0aW9uLi4uIgoKIyBXYWl0IGZvciBjb25kYSB0byBiZWNvbWUgYXZhaWxhYmxlIChtYXhpbXVtIDUgbWludXRlcykKZWNobyAiV2FpdGluZyBmb3IgY29uZGEgdG8gYmVjb21lIGF2YWlsYWJsZS4uLiIKZm9yIGkgaW4gezEuLjMwMH07IGRvCiAgaWYgWyAtZiAiL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2giIF0gJiYgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoICYmIGNvbmRhIGluZm8gPi9kZXYvbnVsbCAyPiYxOyB0aGVuCiAgICBlY2hvICJDb25kYSBpcyBhdmFpbGFibGUgYWZ0ZXIgJGkgc2Vjb25kcy4iCiAgICBicmVhawogIGZpCiAgc2xlZXAgMQpkb25lCgojIEFjdGl2YXRlIHB5dGhvbjMgZW52aXJvbm1lbnQgaWYgY29uZGEgaXMgcmVhZHkKaWYgY29tbWFuZCAtdiBjb25kYSA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICBlY2hvICJBY3RpdmF0aW5nIGNvbmRhIGVudmlyb25tZW50Li4uIgogIHNvdXJjZSAvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaAogIGNvbmRhIGFjdGl2YXRlIHB5dGhvbjMKCiAgIyBEaXNhYmxlIEp1cHl0ZXJMYWIgZG93bmxvYWQgYW5kIGV4cG9ydCBleHRlbnNpb25zCiAgSlVQWVRFUl9CSU49Ii9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9lbnZzL0p1cHl0ZXJTeXN0ZW1FbnYvYmluL2p1cHl0ZXIiCgogIGlmIFsgLWYgIiRKVVBZVEVSX0JJTiIgXSAmJiAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIC0taGVscCA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgIGVjaG8gIlVzaW5nIEp1cHl0ZXJTeXN0ZW1FbnYganVweXRlciBiaW5hcnkiCiAgICAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIGRpc2FibGUgQGp1cHl0ZXJsYWIvZG9jbWFuYWdlci1leHRlbnNpb246ZG93bmxvYWQKICAgICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gZGlzYWJsZSBAanVweXRlcmxhYi9maWxlYnJvd3Nlci1leHRlbnNpb246ZG93bmxvYWQgIAogICAgJEpVUFlURVJfQklOIGxhYmV4dGVuc2lvbiBkaXNhYmxlIEBqdXB5dGVybGFiL2RvY21hbmFnZXItZXh0ZW5zaW9uOmV4cG9ydAogIGVsc2UKICAgIGVjaG8gIkp1cHl0ZXJTeXN0ZW1FbnYganVweXRlciBkb2VzIG5vdCBzdXBwb3J0IGxhYmV4dGVuc2lvbiwgdHJ5aW5nIGZhbGxiYWNrIgogIGZpCgogICMgQ3JlYXRlIGhhbmRsZXJzLnB5IHRvIGJsb2NrIGZpbGUgZG93bmxvYWRzCiAgZWNobyAiQ3JlYXRpbmcgaGFuZGxlcnMucHkgdG8gZGlzYWJsZSBkb3dubG9hZHMuLi4iCiAgbWtkaXIgLXAgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICBjYXQgPDwgJ0VORCcgPiAvaG9tZS9lYzItdXNlci8uanVweXRlci9oYW5kbGVycy5weQpmcm9tIHRvcm5hZG8gaW1wb3J0IHdlYgpmcm9tIG5vdGVib29rLmJhc2UuaGFuZGxlcnMgaW1wb3J0IElQeXRob25IYW5kbGVyCgpjbGFzcyBGb3JiaWRGaWxlc0hhbmRsZXIoSVB5dGhvbkhhbmRsZXIpOgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBoZWFkKHNlbGYsIHBhdGgpOgogICAgc2VsZi5sb2cuaW5mbygiSEVBRDogRmlsZSBkb3dubG9hZCBmb3JiaWRkZW4uIikKICAgIHJhaXNlIHdlYi5IVFRQRXJyb3IoNDAzKQoKICBAd2ViLmF1dGhlbnRpY2F0ZWQKICBkZWYgZ2V0KHNlbGYsIHBhdGgsIGluY2x1ZGVfYm9keT1UcnVlKToKICAgIHNlbGYubG9nLmluZm8oIkdFVDogRmlsZSBkb3dubG9hZCBmb3JiaWRkZW4uIikKICAgIHJhaXNlIHdlYi5IVFRQRXJyb3IoNDAzKQpFTkQKCiAgIyBDcmVhdGUganVweXRlcl9ub3RlYm9va19jb25maWcucHkgdG8gY29uZmlndXJlIHRoZSBoYW5kbGVyCiAgZWNobyAiQXBwbHlpbmcgSnVweXRlciBjb25maWd1cmF0aW9uLi4uIgogIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2p1cHl0ZXJfbm90ZWJvb2tfY29uZmlnLnB5CmltcG9ydCBvcywgc3lzCnN5cy5wYXRoLmFwcGVuZCgnL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvJykKaW1wb3J0IGhhbmRsZXJzCmMuQ29udGVudHNNYW5hZ2VyLmZpbGVzX2hhbmRsZXJfY2xhc3MgPSAnaGFuZGxlcnMuRm9yYmlkRmlsZXNIYW5kbGVyJwpjLkNvbnRlbnRzTWFuYWdlci5maWxlc19oYW5kbGVyX3BhcmFtcyA9IHt9CkVORAoKICAjIFNldCBjb3JyZWN0IGZpbGUgcGVybWlzc2lvbnMKICBlY2hvICJTZXR0aW5nIGZpbGUgcGVybWlzc2lvbnMuLi4iCiAgY2hvd24gLVIgZWMyLXVzZXI6ZWMyLXVzZXIgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICBjaG1vZCAtUiA3NTUgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKCiAgIyBSZXN0YXJ0IEp1cHl0ZXIgc2VydmVyIHRvIGFwcGx5IGNoYW5nZXMKICBlY2hvICJBdHRlbXB0aW5nIHRvIHJlc3RhcnQgSnVweXRlciBzZXJ2ZXIuLi4iCiAgc3VkbyBzeXN0ZW1jdGwgcmVzdGFydCBqdXB5dGVyLXNlcnZlciB8fCBzdWRvIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9iaW4vanVweXRlci1sYWIgJgogIGVjaG8gIkNvbmZpZ3VyYXRpb24gY29tcGxldGVkLiIKZWxzZQogIGVjaG8gIkNvbmRhIG5vdCBhdmFpbGFibGUgYWZ0ZXIgNSBtaW51dGVzLCBza2lwcGluZyBjb25maWd1cmF0aW9uLiIKZmkKCg==" -> "IyEvYmluL2Jhc2gKCiMgUmVtb3ZlIGV4aXN0aW5nIHN5bWJvbGljIGxpbmsgYW5kIGNsb25lIGZyZXNoIG5vdGVib29rcyByZXBvc2l0b3J5CnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKIyBEb3dubG9hZCBnYXNwaWZzIGJpbmFyeSBmcm9tIFMzIGFuZCBzZXQgZXhlY3V0YWJsZSBwZXJtaXNzaW9ucwphd3MgczMgY3AgInMzOi8vZ2FzaS1kYXRhcG9ydGFsLTIwMjUwNTEzMDIxNzIwNTYyODAwMDAwMDAyL2JpbmFyaWVzL2dhc3BpZnMiIC91c3IvYmluL2dhc3BpZnMKY2htb2QgK3ggL3Vzci9iaW4vZ2FzcGlmcwoKIyBSZW1vdmUgU1NIIGNsaWVudHMgYW5kIHNlcnZlciBwYWNrYWdlcyBmb3Igc2VjdXJpdHkKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiU3RhcnRpbmcgbGlmZWN5Y2xlIG9uX2NyZWF0ZSBjb25maWd1cmF0aW9uLi4uIgoKIyBXYWl0IGZvciBjb25kYSB0byBiZWNvbWUgYXZhaWxhYmxlIChtYXhpbXVtIDUgbWludXRlcykKZWNobyAiV2FpdGluZyBmb3IgY29uZGEgdG8gYmVjb21lIGF2YWlsYWJsZS4uLiIKZm9yIGkgaW4gezEuLjMwMH07IGRvCiAgaWYgWyAtZiAiL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2giIF0gJiYgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoICYmIGNvbmRhIGluZm8gPi9kZXYvbnVsbCAyPiYxOyB0aGVuCiAgICBlY2hvICJDb25kYSBpcyBhdmFpbGFibGUgYWZ0ZXIgJGkgc2Vjb25kcy4iCiAgICBicmVhawogIGZpCiAgc2xlZXAgMQpkb25lCgojIEFjdGl2YXRlIHB5dGhvbjMgZW52aXJvbm1lbnQgaWYgY29uZGEgaXMgcmVhZHkKaWYgY29tbWFuZCAtdiBjb25kYSA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICBlY2hvICJBY3RpdmF0aW5nIGNvbmRhIGVudmlyb25tZW50Li4uIgogIHNvdXJjZSAvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaAogIGNvbmRhIGFjdGl2YXRlIHB5dGhvbjMKCiAgIyBEaXNhYmxlIEp1cHl0ZXJMYWIgZG93bmxvYWQgYW5kIGV4cG9ydCBleHRlbnNpb25zCiAgSlVQWVRFUl9CSU49Ii9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9lbnZzL0p1cHl0ZXJTeXN0ZW1FbnYvYmluL2p1cHl0ZXIiCgogIGlmIFsgLWYgIiRKVVBZVEVSX0JJTiIgXSAmJiAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIC0taGVscCA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgIGVjaG8gIlVzaW5nIEp1cHl0ZXJTeXN0ZW1FbnYganVweXRlciBiaW5hcnkiCiAgICAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIGRpc2FibGUgQGp1cHl0ZXJsYWIvZG9jbWFuYWdlci1leHRlbnNpb246ZG93bmxvYWQKICAgICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gZGlzYWJsZSBAanVweXRlcmxhYi9maWxlYnJvd3Nlci1leHRlbnNpb246ZG93bmxvYWQgIAogICAgJEpVUFlURVJfQklOIGxhYmV4dGVuc2lvbiBkaXNhYmxlIEBqdXB5dGVybGFiL2RvY21hbmFnZXItZXh0ZW5zaW9uOmV4cG9ydAogIGVsc2UKICAgIGVjaG8gIkp1cHl0ZXJTeXN0ZW1FbnYganVweXRlciBkb2VzIG5vdCBzdXBwb3J0IGxhYmV4dGVuc2lvbiwgdHJ5aW5nIGZhbGxiYWNrIgogIGZpCgogICMgQ3JlYXRlIGhhbmRsZXJzLnB5IHRvIGJsb2NrIGZpbGUgZG93bmxvYWRzCiAgZWNobyAiQ3JlYXRpbmcgaGFuZGxlcnMucHkgdG8gZGlzYWJsZSBkb3dubG9hZHMuLi4iCiAgbWtkaXIgLXAgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICBjYXQgPDwgJ0VORCcgPiAvaG9tZS9lYzItdXNlci8uanVweXRlci9oYW5kbGVycy5weQpmcm9tIHRvcm5hZG8gaW1wb3J0IHdlYgpmcm9tIG5vdGVib29rLmJhc2UuaGFuZGxlcnMgaW1wb3J0IElQeXRob25IYW5kbGVyCgpjbGFzcyBGb3JiaWRGaWxlc0hhbmRsZXIoSVB5dGhvbkhhbmRsZXIpOgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBoZWFkKHNlbGYsIHBhdGgpOgogICAgc2VsZi5sb2cuaW5mbygiSEVBRDogRmlsZSBkb3dubG9hZCBmb3JiaWRkZW4uIikKICAgIHJhaXNlIHdlYi5IVFRQRXJyb3IoNDAzKQoKICBAd2ViLmF1dGhlbnRpY2F0ZWQKICBkZWYgZ2V0KHNlbGYsIHBhdGgsIGluY2x1ZGVfYm9keT1UcnVlKToKICAgIHNlbGYubG9nLmluZm8oIkdFVDogRmlsZSBkb3dubG9hZCBmb3JiaWRkZW4uIikKICAgIHJhaXNlIHdlYi5IVFRQRXJyb3IoNDAzKQpFTkQKCiAgIyBDcmVhdGUganVweXRlcl9ub3RlYm9va19jb25maWcucHkgdG8gY29uZmlndXJlIHRoZSBoYW5kbGVyCiAgZWNobyAiQXBwbHlpbmcgSnVweXRlciBjb25maWd1cmF0aW9uLi4uIgogIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2p1cHl0ZXJfbm90ZWJvb2tfY29uZmlnLnB5CmltcG9ydCBvcywgc3lzCnN5cy5wYXRoLmFwcGVuZCgnL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvJykKaW1wb3J0IGhhbmRsZXJzCmMuQ29udGVudHNNYW5hZ2VyLmZpbGVzX2hhbmRsZXJfY2xhc3MgPSAnaGFuZGxlcnMuRm9yYmlkRmlsZXNIYW5kbGVyJwpjLkNvbnRlbnRzTWFuYWdlci5maWxlc19oYW5kbGVyX3BhcmFtcyA9IHt9CkVORAoKICAjIFNldCBjb3JyZWN0IGZpbGUgcGVybWlzc2lvbnMKICBlY2hvICJTZXR0aW5nIGZpbGUgcGVybWlzc2lvbnMuLi4iCiAgY2hvd24gLVIgZWMyLXVzZXI6ZWMyLXVzZXIgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKICBjaG1vZCAtUiA3NTUgL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIKCiAgIyBSZXN0YXJ0IEp1cHl0ZXIgc2VydmVyIHRvIGFwcGx5IGNoYW5nZXMKICBlY2hvICJBdHRlbXB0aW5nIHRvIHJlc3RhcnQgSnVweXRlciBzZXJ2ZXIuLi4iCiAgc3VkbyBzeXN0ZW1jdGwgcmVzdGFydCBqdXB5dGVyLXNlcnZlciB8fCBzdWRvIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9iaW4vanVweXRlci1sYWIgJgogIGVjaG8gIkNvbmZpZ3VyYXRpb24gY29tcGxldGVkLiIKZWxzZQogIGVjaG8gIkNvbmRhIG5vdCBhdmFpbGFibGUgYWZ0ZXIgNSBtaW51dGVzLCBza2lwcGluZyBjb25maWd1cmF0aW9uLiIKZmkKCg=="
      ~ on_start  = "IyEvYmluL2Jhc2gKCiMgUmVtb3ZlIGV4aXN0aW5nIHN5bWJvbGljIGxpbmsgYW5kIGNsb25lIGZyZXNoIG5vdGVib29rcyByZXBvc2l0b3J5CnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKIyBSZW1vdmUgU1NIIGNsaWVudHMgYW5kIHNlcnZlciBwYWNrYWdlcyBmb3Igc2VjdXJpdHkKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiU3RhcnRpbmcgbGlmZWN5Y2xlIG9uX3N0YXJ0IGNvbmZpZ3VyYXRpb24uLi4iCgojIFdhaXQgZm9yIGNvbmRhIHRvIGJlY29tZSBhdmFpbGFibGUgKG1heGltdW0gNSBtaW51dGVzKQplY2hvICJXYWl0aW5nIGZvciBjb25kYSB0byBiZWNvbWUgYXZhaWxhYmxlLi4uIgpmb3IgaSBpbiB7MS4uMzAwfTsgZG8KICBpZiBbIC1mICIvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaCIgXSAmJiBzb3VyY2UgL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2ggJiYgY29uZGEgaW5mbyA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgIGVjaG8gIkNvbmRhIGlzIGF2YWlsYWJsZSBhZnRlciAkaSBzZWNvbmRzLiIKICAgIGJyZWFrCiAgZmkKICBzbGVlcCAxCmRvbmUKCiMgQWN0aXZhdGUgcHl0aG9uMyBlbnZpcm9ubWVudCBpZiBjb25kYSBpcyByZWFkeQppZiBjb21tYW5kIC12IGNvbmRhID4vZGV2L251bGwgMj4mMTsgdGhlbgogIGVjaG8gIkFjdGl2YXRpbmcgY29uZGEgZW52aXJvbm1lbnQuLi4iCiAgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoCiAgY29uZGEgYWN0aXZhdGUgcHl0aG9uMwoKICAjIERpc2FibGUgSnVweXRlckxhYiBkb3dubG9hZCBhbmQgZXhwb3J0IGV4dGVuc2lvbnMKICBKVVBZVEVSX0JJTj0iL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvSnVweXRlclN5c3RlbUVudi9iaW4vanVweXRlciIKCiAgaWYgWyAtZiAiJEpVUFlURVJfQklOIiBdICYmICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gLS1oZWxwID4vZGV2L251bGwgMj4mMTsgdGhlbgogICAgZWNobyAiVXNpbmcgSnVweXRlclN5c3RlbUVudiBqdXB5dGVyIGJpbmFyeSIKICAgICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gZGlzYWJsZSBAanVweXRlcmxhYi9kb2NtYW5hZ2VyLWV4dGVuc2lvbjpkb3dubG9hZAogICAgJEpVUFlURVJfQklOIGxhYmV4dGVuc2lvbiBkaXNhYmxlIEBqdXB5dGVybGFiL2ZpbGVicm93c2VyLWV4dGVuc2lvbjpkb3dubG9hZCAgCiAgICAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIGRpc2FibGUgQGp1cHl0ZXJsYWIvZG9jbWFuYWdlci1leHRlbnNpb246ZXhwb3J0CiAgZWxzZQogICAgZWNobyAiSnVweXRlclN5c3RlbUVudiBqdXB5dGVyIGRvZXMgbm90IHN1cHBvcnQgbGFiZXh0ZW5zaW9uLCB0cnlpbmcgZmFsbGJhY2siCiAgZmkKCiAgIyBDcmVhdGUgaGFuZGxlcnMucHkgdG8gYmxvY2sgZmlsZSBkb3dubG9hZHMKICBlY2hvICJDcmVhdGluZyBoYW5kbGVycy5weSB0byBkaXNhYmxlIGRvd25sb2Fkcy4uLiIKICBta2RpciAtcCAvaG9tZS9lYzItdXNlci8uanVweXRlcgogIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2hhbmRsZXJzLnB5CmZyb20gdG9ybmFkbyBpbXBvcnQgd2ViCmZyb20gbm90ZWJvb2suYmFzZS5oYW5kbGVycyBpbXBvcnQgSVB5dGhvbkhhbmRsZXIKCmNsYXNzIEZvcmJpZEZpbGVzSGFuZGxlcihJUHl0aG9uSGFuZGxlcik6CiAgQHdlYi5hdXRoZW50aWNhdGVkCiAgZGVmIGhlYWQoc2VsZiwgcGF0aCk6CiAgICBzZWxmLmxvZy5pbmZvKCJIRUFEOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBnZXQoc2VsZiwgcGF0aCwgaW5jbHVkZV9ib2R5PVRydWUpOgogICAgc2VsZi5sb2cuaW5mbygiR0VUOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCkVORAoKICAjIENyZWF0ZSBqdXB5dGVyX25vdGVib29rX2NvbmZpZy5weSB0byBjb25maWd1cmUgdGhlIGhhbmRsZXIKICBlY2hvICJBcHBseWluZyBKdXB5dGVyIGNvbmZpZ3VyYXRpb24gdXNpbmcgY3VzdG9tIGhhbmRsZXIuLi4iCiAgY2F0IDw8ICdFTkQnID4gL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvanVweXRlcl9ub3RlYm9va19jb25maWcucHkKaW1wb3J0IG9zLCBzeXMKc3lzLnBhdGguYXBwZW5kKCcvaG9tZS9lYzItdXNlci8uanVweXRlci8nKQppbXBvcnQgaGFuZGxlcnMKYy5Db250ZW50c01hbmFnZXIuZmlsZXNfaGFuZGxlcl9jbGFzcyA9ICdoYW5kbGVycy5Gb3JiaWRGaWxlc0hhbmRsZXInCmMuQ29udGVudHNNYW5hZ2VyLmZpbGVzX2hhbmRsZXJfcGFyYW1zID0ge30KRU5ECgogICMgU2V0IGNvcnJlY3QgZmlsZSBwZXJtaXNzaW9ucwogIGVjaG8gIlNldHRpbmcgZmlsZSBwZXJtaXNzaW9ucy4uLiIKICBjaG93biAtUiBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8uanVweXRlcgogIGNobW9kIC1SIDc1NSAvaG9tZS9lYzItdXNlci8uanVweXRlcgoKICAjIFJlc3RhcnQgSnVweXRlciBzZXJ2ZXIgdG8gYXBwbHkgY2hhbmdlcwogIGVjaG8gIkF0dGVtcHRpbmcgdG8gcmVzdGFydCBKdXB5dGVyIHNlcnZlci4uLiIKICBzdWRvIHN5c3RlbWN0bCByZXN0YXJ0IGp1cHl0ZXItc2VydmVyIHx8IHN1ZG8gL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2Jpbi9qdXB5dGVyLWxhYiAmCiAgZWNobyAiQ29uZmlndXJhdGlvbiBjb21wbGV0ZWQuIgplbHNlCiAgZWNobyAiQ29uZGEgbm90IGF2YWlsYWJsZSBhZnRlciA1IG1pbnV0ZXMsIHNraXBwaW5nIGNvbmZpZ3VyYXRpb24uIgpmaQo=" -> "IyEvYmluL2Jhc2gKCiMgUmVtb3ZlIGV4aXN0aW5nIHN5bWJvbGljIGxpbmsgYW5kIGNsb25lIGZyZXNoIG5vdGVib29rcyByZXBvc2l0b3J5CnN1ZG8gdW5saW5rIC9ob21lL2VjMi11c2VyL3NhbXBsZS1ub3RlYm9va3MKZ2l0IGNsb25lIC0tZGVwdGggMSBodHRwczovL2dpdGh1Yi5jb20vR1NJLVhhcGllbnMtQ1NJUk8vR0FTUEktRVRMLW5vdGVib29rcy5naXQgL2hvbWUvZWMyLXVzZXIvR0FTUEktRVRMLW5vdGVib29rcwpzdWRvIGxuIC1zIC9ob21lL2VjMi11c2VyL0dBU1BJLUVUTC1ub3RlYm9va3MgL2hvbWUvZWMyLXVzZXIvc2FtcGxlLW5vdGVib29rcwoKIyBEb3dubG9hZCBnYXNwaWZzIGJpbmFyeSBmcm9tIFMzIGFuZCBzZXQgZXhlY3V0YWJsZSBwZXJtaXNzaW9ucwphd3MgczMgY3AgInMzOi8vZ2FzaS1kYXRhcG9ydGFsLTIwMjUwNTEzMDIxNzIwNTYyODAwMDAwMDAyL2JpbmFyaWVzL2dhc3BpZnMiIC91c3IvYmluL2dhc3BpZnMKY2htb2QgK3ggL3Vzci9iaW4vZ2FzcGlmcwoKIyBSZW1vdmUgU1NIIGNsaWVudHMgYW5kIHNlcnZlciBwYWNrYWdlcyBmb3Igc2VjdXJpdHkKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLWNsaWVudHMKc3VkbyB5dW0gcmVtb3ZlIC15IC0tc2V0b3B0PWNsZWFuX3JlcXVpcmVtZW50c19vbl9yZW1vdmU9MCBvcGVuc3NoLXNlcnZlcgoKZWNobyAiU3RhcnRpbmcgbGlmZWN5Y2xlIG9uX3N0YXJ0IGNvbmZpZ3VyYXRpb24uLi4iCgojIFdhaXQgZm9yIGNvbmRhIHRvIGJlY29tZSBhdmFpbGFibGUgKG1heGltdW0gNSBtaW51dGVzKQplY2hvICJXYWl0aW5nIGZvciBjb25kYSB0byBiZWNvbWUgYXZhaWxhYmxlLi4uIgpmb3IgaSBpbiB7MS4uMzAwfTsgZG8KICBpZiBbIC1mICIvaG9tZS9lYzItdXNlci9hbmFjb25kYTMvZXRjL3Byb2ZpbGUuZC9jb25kYS5zaCIgXSAmJiBzb3VyY2UgL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2V0Yy9wcm9maWxlLmQvY29uZGEuc2ggJiYgY29uZGEgaW5mbyA+L2Rldi9udWxsIDI+JjE7IHRoZW4KICAgIGVjaG8gIkNvbmRhIGlzIGF2YWlsYWJsZSBhZnRlciAkaSBzZWNvbmRzLiIKICAgIGJyZWFrCiAgZmkKICBzbGVlcCAxCmRvbmUKCiMgQWN0aXZhdGUgcHl0aG9uMyBlbnZpcm9ubWVudCBpZiBjb25kYSBpcyByZWFkeQppZiBjb21tYW5kIC12IGNvbmRhID4vZGV2L251bGwgMj4mMTsgdGhlbgogIGVjaG8gIkFjdGl2YXRpbmcgY29uZGEgZW52aXJvbm1lbnQuLi4iCiAgc291cmNlIC9ob21lL2VjMi11c2VyL2FuYWNvbmRhMy9ldGMvcHJvZmlsZS5kL2NvbmRhLnNoCiAgY29uZGEgYWN0aXZhdGUgcHl0aG9uMwoKICAjIERpc2FibGUgSnVweXRlckxhYiBkb3dubG9hZCBhbmQgZXhwb3J0IGV4dGVuc2lvbnMKICBKVVBZVEVSX0JJTj0iL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2VudnMvSnVweXRlclN5c3RlbUVudi9iaW4vanVweXRlciIKCiAgaWYgWyAtZiAiJEpVUFlURVJfQklOIiBdICYmICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gLS1oZWxwID4vZGV2L251bGwgMj4mMTsgdGhlbgogICAgZWNobyAiVXNpbmcgSnVweXRlclN5c3RlbUVudiBqdXB5dGVyIGJpbmFyeSIKICAgICRKVVBZVEVSX0JJTiBsYWJleHRlbnNpb24gZGlzYWJsZSBAanVweXRlcmxhYi9kb2NtYW5hZ2VyLWV4dGVuc2lvbjpkb3dubG9hZAogICAgJEpVUFlURVJfQklOIGxhYmV4dGVuc2lvbiBkaXNhYmxlIEBqdXB5dGVybGFiL2ZpbGVicm93c2VyLWV4dGVuc2lvbjpkb3dubG9hZCAgCiAgICAkSlVQWVRFUl9CSU4gbGFiZXh0ZW5zaW9uIGRpc2FibGUgQGp1cHl0ZXJsYWIvZG9jbWFuYWdlci1leHRlbnNpb246ZXhwb3J0CiAgZWxzZQogICAgZWNobyAiSnVweXRlclN5c3RlbUVudiBqdXB5dGVyIGRvZXMgbm90IHN1cHBvcnQgbGFiZXh0ZW5zaW9uLCB0cnlpbmcgZmFsbGJhY2siCiAgZmkKCiAgIyBDcmVhdGUgaGFuZGxlcnMucHkgdG8gYmxvY2sgZmlsZSBkb3dubG9hZHMKICBlY2hvICJDcmVhdGluZyBoYW5kbGVycy5weSB0byBkaXNhYmxlIGRvd25sb2Fkcy4uLiIKICBta2RpciAtcCAvaG9tZS9lYzItdXNlci8uanVweXRlcgogIGNhdCA8PCAnRU5EJyA+IC9ob21lL2VjMi11c2VyLy5qdXB5dGVyL2hhbmRsZXJzLnB5CmZyb20gdG9ybmFkbyBpbXBvcnQgd2ViCmZyb20gbm90ZWJvb2suYmFzZS5oYW5kbGVycyBpbXBvcnQgSVB5dGhvbkhhbmRsZXIKCmNsYXNzIEZvcmJpZEZpbGVzSGFuZGxlcihJUHl0aG9uSGFuZGxlcik6CiAgQHdlYi5hdXRoZW50aWNhdGVkCiAgZGVmIGhlYWQoc2VsZiwgcGF0aCk6CiAgICBzZWxmLmxvZy5pbmZvKCJIRUFEOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCgogIEB3ZWIuYXV0aGVudGljYXRlZAogIGRlZiBnZXQoc2VsZiwgcGF0aCwgaW5jbHVkZV9ib2R5PVRydWUpOgogICAgc2VsZi5sb2cuaW5mbygiR0VUOiBGaWxlIGRvd25sb2FkIGZvcmJpZGRlbi4iKQogICAgcmFpc2Ugd2ViLkhUVFBFcnJvcig0MDMpCkVORAoKICAjIENyZWF0ZSBqdXB5dGVyX25vdGVib29rX2NvbmZpZy5weSB0byBjb25maWd1cmUgdGhlIGhhbmRsZXIKICBlY2hvICJBcHBseWluZyBKdXB5dGVyIGNvbmZpZ3VyYXRpb24gdXNpbmcgY3VzdG9tIGhhbmRsZXIuLi4iCiAgY2F0IDw8ICdFTkQnID4gL2hvbWUvZWMyLXVzZXIvLmp1cHl0ZXIvanVweXRlcl9ub3RlYm9va19jb25maWcucHkKaW1wb3J0IG9zLCBzeXMKc3lzLnBhdGguYXBwZW5kKCcvaG9tZS9lYzItdXNlci8uanVweXRlci8nKQppbXBvcnQgaGFuZGxlcnMKYy5Db250ZW50c01hbmFnZXIuZmlsZXNfaGFuZGxlcl9jbGFzcyA9ICdoYW5kbGVycy5Gb3JiaWRGaWxlc0hhbmRsZXInCmMuQ29udGVudHNNYW5hZ2VyLmZpbGVzX2hhbmRsZXJfcGFyYW1zID0ge30KRU5ECgogICMgU2V0IGNvcnJlY3QgZmlsZSBwZXJtaXNzaW9ucwogIGVjaG8gIlNldHRpbmcgZmlsZSBwZXJtaXNzaW9ucy4uLiIKICBjaG93biAtUiBlYzItdXNlcjplYzItdXNlciAvaG9tZS9lYzItdXNlci8uanVweXRlcgogIGNobW9kIC1SIDc1NSAvaG9tZS9lYzItdXNlci8uanVweXRlcgoKICAjIFJlc3RhcnQgSnVweXRlciBzZXJ2ZXIgdG8gYXBwbHkgY2hhbmdlcwogIGVjaG8gIkF0dGVtcHRpbmcgdG8gcmVzdGFydCBKdXB5dGVyIHNlcnZlci4uLiIKICBzdWRvIHN5c3RlbWN0bCByZXN0YXJ0IGp1cHl0ZXItc2VydmVyIHx8IHN1ZG8gL2hvbWUvZWMyLXVzZXIvYW5hY29uZGEzL2Jpbi9qdXB5dGVyLWxhYiAmCiAgZWNobyAiQ29uZmlndXJhdGlvbiBjb21wbGV0ZWQuIgplbHNlCiAgZWNobyAiQ29uZGEgbm90IGF2YWlsYWJsZSBhZnRlciA1IG1pbnV0ZXMsIHNraXBwaW5nIGNvbmZpZ3VyYXRpb24uIgpmaQo="
        tags      = {}
        # (3 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14" -> (known after apply)
      ~ code_sha256                 = "eXuVw1quYfakEb603qe3rkMA3vdULPvsLJJSFoUANdA=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-09-19T08:54:24.530+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer:14" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:460722568061:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "OBz4Jl/5RIXKJjdMZTZOk4xJ48ftrjFSjZSSumuHYrLb/XWbBMWs+Cg0Jk8xbzB0tFZentfctIlLqpcNZzBU7A==" -> "eikIuwK+BCRIO/ykM0xyDSh/nuKu31/RxVGVkCq6sA4XvDoyn+tpxnz2m8syCqFpXIhTY94Tzp29hLW3XV4/dQ==" # forces replacement
      ~ source_code_size            = 17975948 -> (known after apply)
      ~ version                     = "14" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.webgui.aws_s3_object.version will be updated in-place
  ~ resource "aws_s3_object" "version" {
      - content                       = "v1.1.0-53-g43bf7d6b+" -> null
        id                            = "version.txt"
        tags                          = {}
      + version_id                    = (known after apply)
        # (25 unchanged attributes hidden)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "4246051607223719491" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "23e6e538c25cb6213c04ee319214ff9927cb2b2c" -> "6fe3a38392614112df1d1a3c716354f99bc6f8bc"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "3250323470975810753" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "23e6e538c25cb6213c04ee319214ff9927cb2b2c" -> "6fe3a38392614112df1d1a3c716354f99bc6f8bc"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate must be replaced
-/+ resource "terraform_data" "cloudfront-version-invalidate" {
      ~ id               = "0e25688f-2f18-1874-e3c4-00c0b2d877d2" -> (known after apply)
      ~ triggers_replace = [
          ~ "v1.1.0-53-g43bf7d6b+" -> "",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "4225777359000061894" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271883152718000" -> "1758533832560466000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1597771964846729935" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271883249394000" -> "1758533832653050800"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "118287098858185825" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271883222724000" -> "1758533832452442000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "1057957732343439191" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271883051130000" -> "1758533832738571000"
            # (1 unchanged element hidden)
        }
    }

  # module.error-catcher.module.lambda-notifyOnError.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6825389422907232084" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1758271880020920000" -> "1758533833153714800"
            # (1 unchanged element hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "097bdba99e5d48c69ab7a4958828189a94a2e9db"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this will be created
  + resource "docker_registry_image" "this" {
      + id                   = (known after apply)
      + insecure_skip_verify = false
      + keep_remotely        = false
      + name                 = "460722568061.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + sha256_digest        = (known after apply)
      + triggers             = {
          + "dir_sha" = "097bdba99e5d48c69ab7a4958828189a94a2e9db"
        }
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/ab37e255a2ccd6740a638703305a24b3f64ab742559c90401315a7069a04ce71.zip" -> "builds/98ba24f28b9c5066f0bd7ecb50a4d3f55e09d60219ebc57765a6b41e2f0785d2.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-09-19T16:52:59.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_libraries_layer:18",
          - "arn:aws:lambda:ap-southeast-3:460722568061:layer:sbeacon_backend_python_modules_layer:13",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/98ba24f28b9c5066f0bd7ecb50a4d3f55e09d60219ebc57765a6b41e2f0785d2.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha2
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.